Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/uart.h
/*
 * Component description for UART
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-12-19T08:59:38Z */
#ifndef _PIC32CXMTSH_UART_COMPONENT_H_
#define _PIC32CXMTSH_UART_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR UART                                         */
/* ************************************************************************** */

/* -------- UART_CR : (UART Offset: 0x00) ( /W 32) Control Register -------- */
#define UART_CR_RSTRX_Pos                     _UINT32_(2)                                          /* (UART_CR) Reset Receiver Position */
#define UART_CR_RSTRX_Msk                     (_UINT32_(0x1) << UART_CR_RSTRX_Pos)                 /* (UART_CR) Reset Receiver Mask */
#define UART_CR_RSTRX(value)                  (UART_CR_RSTRX_Msk & (_UINT32_(value) << UART_CR_RSTRX_Pos)) /* Assigment of value for RSTRX in the UART_CR register */
#define UART_CR_RSTTX_Pos                     _UINT32_(3)                                          /* (UART_CR) Reset Transmitter Position */
#define UART_CR_RSTTX_Msk                     (_UINT32_(0x1) << UART_CR_RSTTX_Pos)                 /* (UART_CR) Reset Transmitter Mask */
#define UART_CR_RSTTX(value)                  (UART_CR_RSTTX_Msk & (_UINT32_(value) << UART_CR_RSTTX_Pos)) /* Assigment of value for RSTTX in the UART_CR register */
#define UART_CR_RXEN_Pos                      _UINT32_(4)                                          /* (UART_CR) Receiver Enable Position */
#define UART_CR_RXEN_Msk                      (_UINT32_(0x1) << UART_CR_RXEN_Pos)                  /* (UART_CR) Receiver Enable Mask */
#define UART_CR_RXEN(value)                   (UART_CR_RXEN_Msk & (_UINT32_(value) << UART_CR_RXEN_Pos)) /* Assigment of value for RXEN in the UART_CR register */
#define UART_CR_RXDIS_Pos                     _UINT32_(5)                                          /* (UART_CR) Receiver Disable Position */
#define UART_CR_RXDIS_Msk                     (_UINT32_(0x1) << UART_CR_RXDIS_Pos)                 /* (UART_CR) Receiver Disable Mask */
#define UART_CR_RXDIS(value)                  (UART_CR_RXDIS_Msk & (_UINT32_(value) << UART_CR_RXDIS_Pos)) /* Assigment of value for RXDIS in the UART_CR register */
#define UART_CR_TXEN_Pos                      _UINT32_(6)                                          /* (UART_CR) Transmitter Enable Position */
#define UART_CR_TXEN_Msk                      (_UINT32_(0x1) << UART_CR_TXEN_Pos)                  /* (UART_CR) Transmitter Enable Mask */
#define UART_CR_TXEN(value)                   (UART_CR_TXEN_Msk & (_UINT32_(value) << UART_CR_TXEN_Pos)) /* Assigment of value for TXEN in the UART_CR register */
#define UART_CR_TXDIS_Pos                     _UINT32_(7)                                          /* (UART_CR) Transmitter Disable Position */
#define UART_CR_TXDIS_Msk                     (_UINT32_(0x1) << UART_CR_TXDIS_Pos)                 /* (UART_CR) Transmitter Disable Mask */
#define UART_CR_TXDIS(value)                  (UART_CR_TXDIS_Msk & (_UINT32_(value) << UART_CR_TXDIS_Pos)) /* Assigment of value for TXDIS in the UART_CR register */
#define UART_CR_RSTSTA_Pos                    _UINT32_(8)                                          /* (UART_CR) Reset Status Position */
#define UART_CR_RSTSTA_Msk                    (_UINT32_(0x1) << UART_CR_RSTSTA_Pos)                /* (UART_CR) Reset Status Mask */
#define UART_CR_RSTSTA(value)                 (UART_CR_RSTSTA_Msk & (_UINT32_(value) << UART_CR_RSTSTA_Pos)) /* Assigment of value for RSTSTA in the UART_CR register */
#define UART_CR_RETTO_Pos                     _UINT32_(10)                                         /* (UART_CR) Rearm Time-out Position */
#define UART_CR_RETTO_Msk                     (_UINT32_(0x1) << UART_CR_RETTO_Pos)                 /* (UART_CR) Rearm Time-out Mask */
#define UART_CR_RETTO(value)                  (UART_CR_RETTO_Msk & (_UINT32_(value) << UART_CR_RETTO_Pos)) /* Assigment of value for RETTO in the UART_CR register */
#define UART_CR_STTTO_Pos                     _UINT32_(11)                                         /* (UART_CR) Start Time-out Position */
#define UART_CR_STTTO_Msk                     (_UINT32_(0x1) << UART_CR_STTTO_Pos)                 /* (UART_CR) Start Time-out Mask */
#define UART_CR_STTTO(value)                  (UART_CR_STTTO_Msk & (_UINT32_(value) << UART_CR_STTTO_Pos)) /* Assigment of value for STTTO in the UART_CR register */
#define UART_CR_REQCLR_Pos                    _UINT32_(12)                                         /* (UART_CR) Request Clear Position */
#define UART_CR_REQCLR_Msk                    (_UINT32_(0x1) << UART_CR_REQCLR_Pos)                /* (UART_CR) Request Clear Mask */
#define UART_CR_REQCLR(value)                 (UART_CR_REQCLR_Msk & (_UINT32_(value) << UART_CR_REQCLR_Pos)) /* Assigment of value for REQCLR in the UART_CR register */
#define UART_CR_OPT_SLEEP_Pos                 _UINT32_(14)                                         /* (UART_CR) Optical Logic Sleep Mode Command Position */
#define UART_CR_OPT_SLEEP_Msk                 (_UINT32_(0x1) << UART_CR_OPT_SLEEP_Pos)             /* (UART_CR) Optical Logic Sleep Mode Command Mask */
#define UART_CR_OPT_SLEEP(value)              (UART_CR_OPT_SLEEP_Msk & (_UINT32_(value) << UART_CR_OPT_SLEEP_Pos)) /* Assigment of value for OPT_SLEEP in the UART_CR register */
#define UART_CR_Msk                           _UINT32_(0x00005DFC)                                 /* (UART_CR) Register Mask  */


